spec/support/stripe/evt_customer_subscription_deleted.json

{
  "id": "evt_1ccte7dydcromj6ppiy1zwgb",
  "type": "customer.subscription.deleted",
  "data": {
    "object": {
      "id": "sub_CRMQ3P8idLYVi8",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1522972800,
      "cancel_at_period_end": false,
      "canceled_at": 1522779255,
      "created": 1520296220,
      "current_period_end": 1522972800,
      "current_period_start": 1520296220,
      "customer": "cus_CRMQBJw5gvc2RF",
      "days_until_due": null,
      "discount": null,
      "ended_at": 1522779255,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CRMQKgEqGyR8RK",
            "object": "subscription_item",
            "created": 1520296221,
            "metadata": {
            },
            "plan": {
              "id": "monthly",
              "object": "plan",
              "amount": 900,
              "billing_scheme": "per_unit",
              "created": 1504027263,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": true,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_BUmMe4Utr1P60F",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed",
              "statement_descriptor": null,
              "name": "Monthly"
            },
            "quantity": 1,
            "subscription": "sub_CRMQ3P8idLYVi8"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CRMQ3P8idLYVi8"
      },
      "livemode": true,
      "metadata": {
        "automatic": "true"
      },
      "plan": {
        "id": "monthly",
        "object": "plan",
        "amount": 900,
        "billing_scheme": "per_unit",
        "created": 1504027263,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_BUmMe4Utr1P60F",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed",
        "statement_descriptor": null,
        "name": "Monthly"
      },
      "quantity": 1,
      "start": 1520296220,
      "status": "canceled",
      "tax_percent": null,
      "trial_end": 1522972800,
      "trial_start": 1520296220
    },
    "previous_attributes": null
  }
}
