spec/support/stripe/evt_customer_subscription_trial_will_end.json

{
  "id": "evt_1CYTcnLl1LzrhllYiVnKLwGl",
  "object": "event",
  "api_version": "2017-06-05",
  "created": 1527922445,
  "data": {
    "object": {
      "id": "sub_CyQTrRmxiYQfd6",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1527922739,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1527922441,
      "current_period_end": 1527922739,
      "current_period_start": 1527922441,
      "customer": "cus_dummy_stripe",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CyQTc60YU5RvLj",
            "object": "subscription_item",
            "created": 1527922442,
            "metadata": {
            },
            "plan": {
              "id": "monthly",
              "object": "plan",
              "aggregate_usage": null,
              "amount": 1699,
              "billing_scheme": "per_unit",
              "created": 1527613677,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "name": "Monthly",
              "nickname": null,
              "product": "prod_Cx5TI4jqU1IN8S",
              "statement_descriptor": null,
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_CyQTrRmxiYQfd6"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CyQTrRmxiYQfd6"
      },
      "livemode": false,
      "metadata": {
        "automatic": "true"
      },
      "plan": {
        "id": "monthly",
        "object": "plan",
        "aggregate_usage": null,
        "amount": 1699,
        "billing_scheme": "per_unit",
        "created": 1527613677,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "name": "Monthly",
        "nickname": null,
        "product": "prod_Cx5TI4jqU1IN8S",
        "statement_descriptor": null,
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "start": 1527922441,
      "status": "trialing",
      "tax_percent": null,
      "trial_end": 1527922739,
      "trial_start": 1527922441
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "customer.subscription.trial_will_end"
}
