spec/support/stripe/evt_customer_subscription_updated.json

{
  "id": "evt_1CEXRmDyDCrOMJ6PAIxCDdA7",
  "object": "event",
  "api_version": "2017-06-05",
  "created": 1523170578,
  "data": {
    "object": {
      "id": "sub_CSD2Uu8EPTvpG9",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1520491964,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1520491964,
      "current_period_end": 1525762364,
      "current_period_start": 1523170364,
      "customer": "cus_CRsMH2PSiwJHKK",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CSD2hGN6mrgeYJ",
            "object": "subscription_item",
            "created": 1520491964,
            "metadata": {
            },
            "plan": {
              "id": "monthly",
              "object": "plan",
              "amount": 900,
              "billing_scheme": "per_unit",
              "created": 1505107002,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_BUPVvdEwmz7Bts",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed",
              "statement_descriptor": null,
              "name": "Monthly"
            },
            "quantity": 1,
            "subscription": "sub_CSD2Uu8EPTvpG9"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CSD2Uu8EPTvpG9"
      },
      "livemode": false,
      "metadata": {
        "automatic": "true"
      },
      "plan": {
        "id": "monthly",
        "object": "plan",
        "amount": 900,
        "billing_scheme": "per_unit",
        "created": 1505107002,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_BUPVvdEwmz7Bts",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed",
        "statement_descriptor": null,
        "name": "Monthly"
      },
      "quantity": 1,
      "start": 1520491964,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "current_period_end": 1523170364,
      "current_period_start": 1520491964
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "customer.subscription.updated"
}
