spec/support/stripe/evt_customer_subscription_updated_2.json

{
  "id": "evt_1CES3DDyDCrOMJ6PraUkQfcE",
  "object": "event",
  "api_version": "2017-06-05",
  "created": 1523149835,
  "data": {
    "object": {
      "id": "sub_CSGRm9HVUruxMh",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1523145600,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1520504618,
      "current_period_end": 1525737600,
      "current_period_start": 1523145600,
      "customer": "cus_CSGRXlQ96YkqAd",
      "days_until_due": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_CSGRxvb3T1YDzH",
            "object": "subscription_item",
            "created": 1520504618,
            "metadata": {
            },
            "plan": {
              "id": "monthly",
              "object": "plan",
              "amount": 900,
              "billing_scheme": "per_unit",
              "created": 1505107002,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_BUPVvdEwmz7Bts",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed",
              "statement_descriptor": null,
              "name": "Monthly"
            },
            "quantity": 1,
            "subscription": "sub_CSGRm9HVUruxMh"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_CSGRm9HVUruxMh"
      },
      "livemode": false,
      "metadata": {
        "automatic": "true"
      },
      "plan": {
        "id": "monthly",
        "object": "plan",
        "amount": 900,
        "billing_scheme": "per_unit",
        "created": 1505107002,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": null,
        "product": "prod_BUPVvdEwmz7Bts",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed",
        "statement_descriptor": null,
        "name": "Monthly"
      },
      "quantity": 1,
      "start": 1520504618,
      "status": "past_due",
      "tax_percent": null,
      "trial_end": 1523145600,
      "trial_start": 1520504618
    },
    "previous_attributes": {
      "status": "active"
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "customer.subscription.updated"
}
