spec/support/stripe/evt_invoice_updated.json

{
    "id": "evt_1CHsofLl1LzrhllYE6oeCTlw",
    "object": "event",
    "api_version": "2017-06-05",
    "created": 1523967705,
    "data": {
        "object": {
            "id": "in_1CHseNLl1LzrhllYGumtSdWz",
            "object": "invoice",
            "amount_due": 1699,
            "amount_paid": 0,
            "amount_remaining": 1699,
            "application_fee": null,
            "attempt_count": 0,
            "attempted": false,
            "billing": "charge_automatically",
            "charge": null,
            "closed": true,
            "currency": "usd",
            "customer": "cus_dummy_stripe",
            "date": 1523967067,
            "description": null,
            "discount": null,
            "due_date": null,
            "ending_balance": null,
            "forgiven": false,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "sub_ChH7ttf7l2YtDt",
                        "object": "line_item",
                        "amount": 1699,
                        "currency": "usd",
                        "description": null,
                        "discountable": true,
                        "livemode": false,
                        "metadata": {
                            "automatic": "true"
                        },
                        "period": {
                            "end": 1526559052,
                            "start": 1523967052
                        },
                        "plan": {
                            "id": "monthly",
                            "object": "plan",
                            "amount": 1699,
                            "billing_scheme": "per_unit",
                            "created": 1523208705,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": "monthly",
                            "product": "prod_CdzHGe2YC11uGS",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed",
                            "statement_descriptor": null,
                            "name": "Currents"
                        },
                        "proration": false,
                        "quantity": 1,
                        "subscription": null,
                        "subscription_item": "si_ChH7mcNeU4L3lw",
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1CHseNLl1LzrhllYGumtSdWz/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "C0FF555-0002",
            "paid": false,
            "period_end": 1523967052,
            "period_start": 1523966753,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "subscription": "sub_ChH7ttf7l2YtDt",
            "subtotal": 1699,
            "tax": null,
            "tax_percent": null,
            "total": 1699,
            "webhooks_delivered_at": null
        },
        "previous_attributes": {
            "closed": false,
            "next_payment_attempt": 1523970667
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_uw530QquXlTeBo",
        "idempotency_key": null
    },
    "type": "invoice.updated"
}
